[
	{
		"id" : 1,
		"imdbid" : "tt0337978",
		"title" : "Live Free or Die Hard",
		"year" : 2007,
		"type" : "movie",
		"poster" : "https://m.media-amazon.com/images/M/MV5BNDQxMDE1OTg4NV5BMl5BanBnXkFtZTcwMTMzOTQzMw@@._V1_SX300.jpg",
		"released" : "2007-06-27",
		"runtime" : "128 min",
		"genre" : "Action, Thriller",
		"plot" : "When someone hacks into the computers at the FBI's Cyber Crime Division; the Director decides to round up all the hackers who could have done this. When he's told that because it's the 4th of July most of their agents are not around so they might have trouble getting people to get the hackers. So he instructs them to get local PD'S to take care of it. And one of the cops they ask is John McClane who is tasked with bringing a hacker named Farrell to the FBI. But as soon as he gets there someone starts shooting at them. McClane manages to get them out but they're still being pursued. And it's just when McClane arrives in Washington that the whole system breaks down and chaos ensues.",
		"imdbrating" : 7.1,
		"director" : "Len Wiseman"
	},
	{
		"id" : 2,
		"imdbid" : "tt1606378",
		"title" : "A Good Day to Die Hard",
		"year" : 2013,
		"type" : "movie",
		"poster" : "https://m.media-amazon.com/images/M/MV5BMTcwNzgyNzUzOV5BMl5BanBnXkFtZTcwMzAwOTA5OA@@._V1_SX300.jpg",
		"released" : "2013-02-14",
		"runtime" : "98 min",
		"genre" : "Action, Thriller",
		"plot" : "Iconoclastic, take-no-prisoners cop John McClane, for the first time, finds himself on foreign soil after traveling to Moscow to help his wayward son Jack - unaware that Jack is really a highly-trained CIA operative out to stop a nuclear weapons heist. With the Russian underworld in pursuit, and battling a countdown to war, the two McClanes discover that their opposing methods make them unstoppable heroes.",
		"imdbrating" : 5.3,
		"director" : "John Moore"
	},
	{
		"id" : 3,
		"imdbid" : "tt1201607",
		"title" : "Harry Potter and the Deathly Hallows: Part 2",
		"year" : 2011,
		"type" : "movie",
		"poster" : "https://m.media-amazon.com/images/M/MV5BMjIyZGU4YzUtNDkzYi00ZDRhLTljYzctYTMxMDQ4M2E0Y2YxXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_SX300.jpg",
		"released" : "2011-07-15",
		"runtime" : "130 min",
		"genre" : "Adventure, Drama, Fantasy, Mystery",
		"plot" : "Harry, Ron, and Hermione continue their quest of finding and destroying the Dark Lord's three remaining Horcruxes, the magical items responsible for his immortality. But as the mystical Deathly Hallows are uncovered, and Voldemort finds out about their mission, the biggest battle begins and life as they know it will never be the same again.",
		"imdbrating" : 8.1,
		"director" : "David Yates"
	},
	{
		"id" : 4,
		"imdbid" : "tt0241527",
		"title" : "Harry Potter and the Sorcerer's Stone",
		"year" : 2001,
		"type" : "movie",
		"poster" : "https://m.media-amazon.com/images/M/MV5BNjQ3NWNlNmQtMTE5ZS00MDdmLTlkZjUtZTBlM2UxMGFiMTU3XkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SX300.jpg",
		"released" : "2001-11-16",
		"runtime" : "152 min",
		"genre" : "Adventure, Family, Fantasy",
		"plot" : "This is the tale of Harry Potter, an ordinary 11-year-old boy serving as a sort of slave for his aunt and uncle who learns that he is actually a wizard and has been invited to attend the Hogwarts School for Witchcraft and Wizardry. Harry is snatched away from his mundane existence by Hagrid, the grounds keeper for Hogwarts, and quickly thrown into a world completely foreign to both him and the viewer. Famous for an incident that happened at his birth, Harry makes friends easily at his new school. He soon finds, however, that the wizarding world is far more dangerous for him than he would have imagined, and he quickly learns that not all wizards are ones to be trusted.",
		"imdbrating" : 7.6,
		"director" : "Chris Columbus"
	},
	{
		"id" : 5,
		"imdbid" : "tt0295297",
		"title" : "Harry Potter and the Chamber of Secrets",
		"year" : 2002,
		"type" : "movie",
		"poster" : "https://m.media-amazon.com/images/M/MV5BMTcxODgwMDkxNV5BMl5BanBnXkFtZTYwMDk2MDg3._V1_SX300.jpg",
		"released" : "2002-11-15",
		"runtime" : "161 min",
		"genre" : "Adventure, Family, Fantasy, Mystery",
		"plot" : "Forced to spend his summer holidays with his muggle relations, Harry Potter gets a real shock when he gets a surprise visitor: Dobby the house-elf, who warns Harry Potter against returning to Hogwarts, for terrible things are going to happen. Harry decides to ignore Dobby's warning and continues with his pre-arranged schedule. But at Hogwarts, strange and terrible things are indeed happening: Harry is suddenly hearing mysterious voices from inside the walls, muggle-born students are being attacked, and a message scrawled on the wall in blood puts everyone on his/her guard - \"The Chamber Of Secrets Has Been Opened. Enemies Of The Heir, Beware\" .",
		"imdbrating" : 7.4,
		"director" : "Chris Columbus"
	},
	{
		"id" : 6,
		"imdbid" : "tt0304141",
		"title" : "Harry Potter and the Prisoner of Azkaban",
		"year" : 2004,
		"type" : "movie",
		"poster" : "https://m.media-amazon.com/images/M/MV5BMTY4NTIwODg0N15BMl5BanBnXkFtZTcwOTc0MjEzMw@@._V1_SX300.jpg",
		"released" : "2004-06-04",
		"runtime" : "142 min",
		"genre" : "Adventure, Family, Fantasy, Mystery",
		"plot" : "Harry Potter is having a tough time with his relatives (yet again). He runs away after using magic to inflate Uncle Vernon's sister Marge who was being offensive towards Harry's parents. Initially scared for using magic outside the school, he is pleasantly surprised that he won't be penalized after all. However, he soon learns that a dangerous criminal and Voldemort's trusted aide Sirius Black has escaped from the Azkaban prison and wants to kill Harry to avenge the Dark Lord. To worsen the conditions for Harry, vile creatures called Dementors are appointed to guard the school gates and inexplicably happen to have the most horrible effect on him. Little does Harry know that by the end of this year, many holes in his past (whatever he knows of it) will be filled up and he will have a clearer vision of what the future has in store...",
		"imdbrating" : 7.9,
		"director" : "Alfonso Cuarón"
	},
	{
		"id" : 7,
		"imdbid" : "tt0330373",
		"title" : "Harry Potter and the Goblet of Fire",
		"year" : 2005,
		"type" : "movie",
		"poster" : "https://m.media-amazon.com/images/M/MV5BMTI1NDMyMjExOF5BMl5BanBnXkFtZTcwOTc4MjQzMQ@@._V1_SX300.jpg",
		"released" : "2005-11-18",
		"runtime" : "157 min",
		"genre" : "Adventure, Family, Fantasy, Mystery",
		"plot" : "Harry's fourth year at Hogwarts is about to start and he is enjoying the summer vacation with his friends. They get the tickets to The Quidditch World Cup Final but after the match is over, people dressed like Lord Voldemort's 'Death Eaters' set a fire to all the visitors' tents, coupled with the appearance of Voldemort's symbol, the 'Dark Mark' in the sky, which causes a frenzy across the magical community. That same year, Hogwarts is hosting 'The Triwizard Tournament', a magical tournament between three well-known schools of magic : Hogwarts, Beauxbatons and Durmstrang. The contestants have to be above the age of 17, and are chosen by a magical object called Goblet of Fire. On the night of selection, however, the Goblet spews out four names instead of the usual three, with Harry unwittingly being selected as the Fourth Champion. Since the magic cannot be reversed, Harry is forced to go with it and brave three exceedingly difficult tasks.",
		"imdbrating" : 7.7,
		"director" : "Mike Newell"
	},
	{
		"id" : 8,
		"imdbid" : "tt0373889",
		"title" : "Harry Potter and the Order of the Phoenix",
		"year" : 2007,
		"type" : "movie",
		"poster" : "https://m.media-amazon.com/images/M/MV5BMTM0NTczMTUzOV5BMl5BanBnXkFtZTYwMzIxNTg3._V1_SX300.jpg",
		"released" : "2007-07-11",
		"runtime" : "138 min",
		"genre" : "Action, Adventure, Family, Fantasy, Mystery",
		"plot" : "After a lonely summer on Privet Drive, Harry returns to a Hogwarts full of ill-fortune. Few of students and parents believe him or Dumbledore that Voldemort is really back. The ministry had decided to step in by appointing a new Defence Against the Dark Arts teacher that proves to be the nastiest person Harry has ever encountered. Harry also can't help stealing glances with the beautiful Cho Chang. To top it off are dreams that Harry can't explain, and a mystery behind something Voldemort is searching for. With these many things Harry begins one of his toughest years at Hogwarts School of Witchcraft and Wizardry.",
		"imdbrating" : 7.5,
		"director" : "David Yates"
	},
	{
		"id" : 9,
		"imdbid" : "tt0926084",
		"title" : "Harry Potter and the Deathly Hallows: Part 1",
		"year" : 2010,
		"type" : "movie",
		"poster" : "https://m.media-amazon.com/images/M/MV5BMTQ2OTE1Mjk0N15BMl5BanBnXkFtZTcwODE3MDAwNA@@._V1_SX300.jpg",
		"released" : "2010-11-19",
		"runtime" : "146 min",
		"genre" : "Adventure, Fantasy, Mystery",
		"plot" : "Voldemort's power is growing stronger. He now has control over the Ministry of Magic and Hogwarts. Harry, Ron, and Hermione decide to finish Dumbledore's work and find the rest of the Horcruxes to defeat the Dark Lord. But little hope remains for the Trio, and the rest of the Wizarding World, so everything they do must go as planned.",
		"imdbrating" : 7.7,
		"director" : "David Yates"
	},
	{
		"id" : 10,
		"imdbid" : "tt0417741",
		"title" : "Harry Potter and the Half-Blood Prince",
		"year" : 2009,
		"type" : "movie",
		"poster" : "https://m.media-amazon.com/images/M/MV5BNzU3NDg4NTAyNV5BMl5BanBnXkFtZTcwOTg2ODg1Mg@@._V1_SX300.jpg",
		"released" : "2009-07-15",
		"runtime" : "153 min",
		"genre" : "Action, Adventure, Family, Fantasy, Mystery",
		"plot" : "In the sixth year at Hogwarts School of Witchcraft, and in both wizard and muggle worlds Lord Voldemort and his henchmen are increasingly active. With vacancies to fill at Hogwarts, Professor Dumbledore persuades Horace Slughorn, back from retirement to become the potions teacher, while Professor Snape receives long awaited news. Harry Potter, together with Dumbledore, must face treacherous tasks to defeat his evil nemesis.",
		"imdbrating" : 7.6,
		"director" : "David Yates"
	}
]
